#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_codestarconnections_connection.github_connection: Refreshing state... [id=arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db]
module.iam.aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_codebuild_project.build_project: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project]
aws_codepipeline.codepipeline: Refreshing state... [id=bff-pipeline]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-061517c67b227b30c]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
module.asics_cluster.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics_cluster]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
module.iam.aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline-role]
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
module.iam.aws_iam_role.codedeploy_role: Refreshing state... [id=codedeploy-role]
module.iam.aws_iam_role.codebuild_role: Refreshing state... [id=codebuild-role]
module.iam.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
module.iam.aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240905152951292300000007]
module.iam.aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
module.iam.aws_iam_role_policy.codepipeline_service_role_policy: Refreshing state... [id=codepipeline-role:terraform-20240905152951063500000001]
module.iam.aws_iam_role_policy_attachment.codepipeline_attach: Refreshing state... [id=codepipeline-role-20240905152951204900000004]
module.iam.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240905152951365400000009]
module.iam.aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-role:terraform-20240905152951068900000002]
module.iam.aws_iam_role_policy_attachment.codedeploy_attach: Refreshing state... [id=codedeploy-role-20240905152951221200000005]
module.iam.aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-role:terraform-20240905152951089600000003]
module.iam.aws_iam_role_policy_attachment.codebuild_attach: Refreshing state... [id=codebuild-role-20240905152951331600000008]
module.iam.aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240905152951230800000006]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b009e3d26af314cc]
module.vpc.aws_internet_gateway.gw: Refreshing state... [id=igw-0458a54ca292f7d3b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cb3a003b39a76317]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06bca612ff40ca56a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fa599cfaf89baabd]
module.gtw_alb.aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c927e45b813c5abe]
aws_security_group.gtw_lb: Refreshing state... [id=sg-03acdb2dde66103de]
module.bff_alb.aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/6afde97657007567]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
module.vpc.aws_route.internet_access: Refreshing state... [id=r-rtb-0ee3dd4800c8d01201080289494]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0dd6b65a634dded31]
module.gtw_alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/f7a7254f8bd3d580]
aws_security_group.lb: Refreshing state... [id=sg-0cec844cd76d5ef4a]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0042fe3d797e6a3c1]
module.bff_alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/f3b49c1d0d2250b9]
aws_security_group.redis_sg: Refreshing state... [id=sg-03f49e0bfcb8199e4]
module.gtw_alb.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/f7a7254f8bd3d580/52ba4e4127bc60c3]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
module.bff_alb.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/f3b49c1d0d2250b9/6a2877fd19f64867]
data.aws_elasticache_replication_group.redis_cluster: Reading...
data.aws_elasticache_replication_group.redis_cluster: Read complete after 1s [id=my-redis-cluster]
module.ecs_bff.aws_ecs_task_definition.task[0]: Refreshing state... [id=bff-task]
module.ecs_gtw.aws_ecs_task_definition.task[0]: Refreshing state... [id=gtw-task]
module.ecs_bff.aws_ecs_service.service[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics_cluster/bff-service]
module.ecs_gtw.aws_ecs_service.service[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics_cluster/gtw-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_codebuild_project.build_project will be destroyed
  # (because aws_codebuild_project.build_project is not in configuration)
  - resource "aws_codebuild_project" "build_project" {
      - arn                    = "arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project" -> null
      - badge_enabled          = false -> null
      - build_timeout          = 60 -> null
      - concurrent_build_limit = 0 -> null
      - encryption_key         = "arn:aws:kms:eu-west-1:802288441694:alias/aws/s3" -> null
      - id                     = "arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project" -> null
      - name                   = "bff-codebuild-project" -> null
      - project_visibility     = "PRIVATE" -> null
      - queued_timeout         = 480 -> null
      - service_role           = "arn:aws:iam::802288441694:role/codebuild-role" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null

      - artifacts {
          - encryption_disabled    = false -> null
          - name                   = "bff-codebuild-project" -> null
          - override_artifact_name = false -> null
          - packaging              = "NONE" -> null
          - type                   = "CODEPIPELINE" -> null
        }

      - cache {
          - modes = [] -> null
          - type  = "NO_CACHE" -> null
        }

      - environment {
          - compute_type                = "BUILD_GENERAL1_SMALL" -> null
          - image                       = "aws/codebuild/standard:4.0" -> null
          - image_pull_credentials_type = "CODEBUILD" -> null
          - privileged_mode             = false -> null
          - type                        = "LINUX_CONTAINER" -> null

          - environment_variable {
              - name  = "AWS_DEFAULT_REGION" -> null
              - type  = "PLAINTEXT" -> null
              - value = "eu-west-1" -> null
            }
        }

      - logs_config {
          - cloudwatch_logs {
              - status = "ENABLED" -> null
            }
          - s3_logs {
              - encryption_disabled = false -> null
              - status              = "DISABLED" -> null
            }
        }

      - source {
          - buildspec           = "buildspec.yml" -> null
          - git_clone_depth     = 0 -> null
          - insecure_ssl        = false -> null
          - report_build_status = false -> null
          - type                = "CODEPIPELINE" -> null
        }
    }

  # aws_codepipeline.codepipeline will be destroyed
  # (because aws_codepipeline.codepipeline is not in configuration)
  - resource "aws_codepipeline" "codepipeline" {
      - arn      = "arn:aws:codepipeline:eu-west-1:802288441694:bff-pipeline" -> null
      - id       = "bff-pipeline" -> null
      - name     = "bff-pipeline" -> null
      - role_arn = "arn:aws:iam::802288441694:role/codepipeline-role" -> null
      - tags     = {} -> null
      - tags_all = {} -> null

      - artifact_store {
          - location = "my-build-artifacts-bucket-asics" -> null
          - type     = "S3" -> null
        }

      - stage {
          - name = "Source" -> null

          - action {
              - category         = "Source" -> null
              - configuration    = {
                  - "BranchName"       = "main"
                  - "ConnectionArn"    = "arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db"
                  - "FullRepositoryId" = "mandicm223/example-gh-code-pipeline"
                } -> null
              - input_artifacts  = [] -> null
              - name             = "Source" -> null
              - output_artifacts = [
                  - "source_output",
                ] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeStarSourceConnection" -> null
              - run_order        = 1 -> null
              - version          = "1" -> null
            }
        }
      - stage {
          - name = "Build" -> null

          - action {
              - category         = "Build" -> null
              - configuration    = {
                  - "ProjectName" = "bff-codebuild-project"
                } -> null
              - input_artifacts  = [
                  - "source_output",
                ] -> null
              - name             = "BuildBff" -> null
              - output_artifacts = [
                  - "build_output",
                ] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeBuild" -> null
              - run_order        = 1 -> null
              - version          = "1" -> null
            }
        }
    }

  # aws_codestarconnections_connection.github_connection will be destroyed
  # (because aws_codestarconnections_connection.github_connection is not in configuration)
  - resource "aws_codestarconnections_connection" "github_connection" {
      - arn               = "arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db" -> null
      - connection_status = "AVAILABLE" -> null
      - id                = "arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db" -> null
      - name              = "github-connection" -> null
      - provider_type     = "GitHub" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0042fe3d797e6a3c1"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0dd6b65a634dded31"
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # module.bff_code_pipeline.aws_codebuild_project.build_project will be created
  + resource "aws_codebuild_project" "build_project" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 60
      + description          = (known after apply)
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "bff-service-code_build_project"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = "arn:aws:iam::802288441694:role/codebuild-role"
      + tags_all             = (known after apply)

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "CODEPIPELINE"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/standard:4.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "AWS_DEFAULT_REGION"
              + type  = "PLAINTEXT"
              + value = "default region"
            }
        }

      + source {
          + buildspec = "buildspec.yml"
          + type      = "CODEPIPELINE"
        }
    }

  # module.bff_code_pipeline.aws_codepipeline.codepipeline will be created
  + resource "aws_codepipeline" "codepipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "bff-service-pipeline"
      + role_arn = "arn:aws:iam::802288441694:role/codepipeline-role"
      + tags_all = (known after apply)

      + artifact_store {
          + location = "my-build-artifacts-bucket-asics"
          + region   = (known after apply)
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = (known after apply)
              + name             = "Source"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeStarSourceConnection"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"

          + action {
              + category         = "Build"
              + configuration    = {
                  + "ProjectName" = "bff-service-code_build_project"
                }
              + input_artifacts  = [
                  + "source_output",
                ]
              + name             = "bff-service-code_build_project"
              + output_artifacts = [
                  + "build_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
    }

  # module.bff_code_pipeline.aws_codestarconnections_connection.github_connection will be created
  + resource "aws_codestarconnections_connection" "github_connection" {
      + arn               = (known after apply)
      + connection_status = (known after apply)
      + id                = (known after apply)
      + name              = "github-connection"
      + provider_type     = "GitHub"
      + tags_all          = (known after apply)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*